Обработки/Reports/_РасчетМинимальнойДостаточности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетМинимальнойДостаточности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баланс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредиторскаяЗадолженность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчтенВОтчете</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтогиПоВидамДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баланс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредиторскаяЗадолженность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетМинимальнойДостаточности/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
	ЭтоРЭМ		= Отчет.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
	ЭтоРПИ		= Отчет.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ");
	ЭтоТраст	= Отчет.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьТабличныеДокументыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыНаСервере()
	
	РеквизитФормыВЗначение("Отчет").ЗаполнитьТабличныеДокументы(РезультатРасчетМинимальнойСуммыСС, РезультатСЧА, РезультатБалансоваяСтоимостьЮрЛиц, РезультатСтоимостьФЛ);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьExcel(Команда)
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	
	Отказ = Ложь;
	
	ЗаполнитьДанныеОтчетаНаСервере(Отказ);
		
	Если НЕ Отказ Тогда
		ЗаполнитьExcel();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОтчетаНаСервере(Отказ)
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	ШаблонExcel = ОбъектОтчет.ПолучитьМакет("ШаблонExcel");
	
	ОбъектОтчет.ЗаполнитьДанныеОтчета(Отказ);
	ЗначениеВРеквизитФормы(ОбъектОтчет, "Отчет");
	
	ВидыДоговоров = Новый Структура;
	Для Каждого ВидДоговора Из Метаданные.Перечисления.ВидыДоговоровДоверительногоУправления.ЗначенияПеречисления Цикл
		ВидыДоговоров.Вставить(ВидДоговора.Имя, Перечисления.ВидыДоговоровДоверительногоУправления[ВидДоговора.Имя]);
	КонецЦикла;
	
КонецПроцедуры

#Область ЗаполнитьExcel

&НаКлиенте
Процедура ЗаполнитьExcel()
	
	//ИмяФайлаШаблонаExcel = КаталогВременныхФайлов() + СтрШаблон("Расчет минимальной достаточности %1 %2.xlsx", Отчет.Организация, Формат(Отчет.ДатаОтчета, "ДФ=dd.MM.yy"))
	ИмяФайлаШаблонаExcel = ПолучитьИмяВременногоФайла("xlsx"); //;

	ШаблонExcel.Записать(ИмяФайлаШаблонаExcel);
	
	// создадим документ MS Excel на основании сохраненного шаблона
	Excel = Новый COMОбъект("Excel.Application");
	Excel.Visible = Ложь;
	
	Excel.Workbooks.Open(ИмяФайлаШаблонаExcel);
	
	Лист = Excel.WorkSheets(1);
	Лист.EnableCalculation = Ложь;
	Лист.Cells(2, 3).Value = Отчет.ДатаОтчета;
	
	ЗаполнитьСЧА(Excel);
	ЗаполнитьЮрЛица(Excel);
	ЗаполнитьФизЛица(Excel);
	
	Лист.EnableCalculation = Истина;
	Лист.Activate();
	
	
#Область ПроверкаЧтоВсеДоговораПопалиВОтчёт

	ПараметрыПоиска = Новый Структура("УчтенВОтчете", Ложь);
	НайденныеСтроки = Отчет.ДанныеОтчета.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НеУчтенныеВидыДоговоров = Новый Массив;
		
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
			Если НеУчтенныеВидыДоговоров.Найти(СтрокаДанных.ВидДоговораДоверительногоУправления) = Неопределено Тогда
				НеУчтенныеВидыДоговоров.Добавить(СтрокаДанных.ВидДоговораДоверительногоУправления);
			КонецЕсли;
		КонецЦикла;	
		ВызватьИсключение "В отчёте не учтены виды договоров: " + СтрСоединить(НеУчтенныеВидыДоговоров, ", ") + ". Формирование отчёта невозможно.";
		
	КонецЕсли;
	
#КонецОбласти
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблонаExcel);
	Исключение
	КонецПопытки;
	
	Excel.Visible = True;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСЧА(Excel)
	
	Лист = Excel.WorkSheets(2);
	Лист.Activate();
	
	ТекущаяСтрока = 4;
	СтрокиЗаголовоков = Новый Массив;
	
	Разделы = Новый Массив;
	
#Область ПИФ_АИФ
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиПаевогоИнвестиционногоФонда);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиАкционерныхИнвестиционныхФондов);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти
	
#Область ПФР
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиПФР);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти
	
#Область ПН
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеПенсионнымиНакоплениями);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти

#Область ПР
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеПенсионнымиРезервами);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти

#Область ЖОВ
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти

	Для Каждого Раздел Из Разделы Цикл
		Раздел.Вставить("СтрокаЗаголовка",  ТекущаяСтрока - 1);

		Область = Лист.Cells(ТекущаяСтрока, 1);
		Область.EntireRow.Select();
		Область.EntireRow.Copy();
		
		Для Каждого СтрокаДанных Из Отчет.ДанныеОтчета Цикл
			Если Раздел.ВидыДоговоровРаздела.Найти(СтрокаДанных.ВидДоговораДоверительногоУправления) <> Неопределено Тогда
				Область.EntireRow.Insert();
				
				Лист.Cells(ТекущаяСтрока, 2).Value = Строка(СтрокаДанных.СчетДоверительногоУправления);
			 	Лист.Cells(ТекущаяСтрока, 3).Value = СтрокаДанных.СЧА;
			 	Лист.Cells(ТекущаяСтрока, 4).Value = СтрокаДанных.РСА;
				
				СтрокаДанных.УчтенВОтчете = Истина;
			 
				ТекущаяСтрока = ТекущаяСтрока + 1;
		    КонецЕсли;
		КонецЦикла;
		
		Если Раздел.СтрокаЗаголовка <> ТекущаяСтрока - 1 Тогда
			Лист.Cells(Раздел.СтрокаЗаголовка, 3).FormulaLocal = СтрШаблон("=СУММ(C%1:C%2)", Раздел.СтрокаЗаголовка + 1, ТекущаяСтрока - 1);
			Лист.Cells(Раздел.СтрокаЗаголовка, 4).FormulaLocal = СтрШаблон("=СУММ(D%1:D%2)", Раздел.СтрокаЗаголовка + 1, ТекущаяСтрока - 1);
		КонецЕсли;
		
		Область.EntireRow.Delete();

		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		СтрокиЗаголовоков.Добавить("Буква" + Раздел.СтрокаЗаголовка);
		
	КонецЦикла;
	
	Лист.Cells(ТекущаяСтрока - 1, 3).FormulaLocal = "=" + СтрЗаменить(СтрСоединить(СтрокиЗаголовоков, "+"), "Буква", "C");
	Лист.Cells(ТекущаяСтрока - 1, 4).FormulaLocal = "=" + СтрЗаменить(СтрСоединить(СтрокиЗаголовоков, "+"), "Буква", "D");
	
	Лист.Cells(1, 1).Select();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЮрЛица(Excel)
	
	Лист = Excel.WorkSheets(3);
	Лист.Activate();
	
	ТекущаяСтрока = 3;
	
	Разделы = Новый Массив;
	
#Область ЮрЛица
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиЮридическогоЛица);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиСаморегулируемыхОрганизаций);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиФОГФ);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеРезервамиСтраховыхКомпаний);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеИмуществомСтраховыхКомпаний);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеСобственнымиСредствамиПенсионныхФондов);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиЦелевыхКапиталов);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти

	Для Каждого Раздел Из Разделы Цикл
		Раздел.Вставить("СтрокаЗаголовка",  ТекущаяСтрока - 1);

		Для Каждого СтрокаДанных Из Отчет.ДанныеОтчета Цикл
			Если Раздел.ВидыДоговоровРаздела.Найти(СтрокаДанных.ВидДоговораДоверительногоУправления) <> Неопределено Тогда
				Область = Лист.Cells(ТекущаяСтрока, 5);
				Область.EntireRow.Select();
				Область.EntireRow.Copy();
				Область.EntireRow.Insert();
				
				Лист.Cells(ТекущаяСтрока, 1).Value = Строка(СтрокаДанных.СчетДоверительногоУправления);
			 	Лист.Cells(ТекущаяСтрока, 2).Value = СтрокаДанных.Баланс;
			 	Лист.Cells(ТекущаяСтрока, 3).Value = СтрокаДанных.СЧА;
			 	Лист.Cells(ТекущаяСтрока, 4).Value = СтрокаДанных.КредиторскаяЗадолженность;
				
				Лист.Cells(ТекущаяСтрока, 5).FormulaLocal = СтрШаблон("=B%1-(C%1+D%1)", ТекущаяСтрока);
				
				СтрокаДанных.УчтенВОтчете = Истина;
				
				//Можно так раскрасить, но хотелось бы, чтобы ячейки меняли цвет при изменении значения пользователем, поэтому сделано через Условное форматирование в шаблоне
				//Если СтрокаДанных.Баланс <> СтрокаДанных.СЧА + СтрокаДанных.КредиторскаяЗадолженность Тогда
				//	Лист.Range(СтрШаблон("A%1:E%1",	ТекущаяСтрока)).Interior.Color = 13353215; //Новый Цвет(255, 192, 203); Розовый
				//КонецЕсли;
			 
				ТекущаяСтрока = ТекущаяСтрока + 1;
		    КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Лист.Range(СтрШаблон("A%1:E%1", ТекущаяСтрока)).Font.Bold = Истина; //Жирный шрифт
	Лист.Cells(ТекущаяСтрока, 1).Value = "Итого:";
	
	Если ТекущаяСтрока = 3 Тогда
		Лист.Cells(ТекущаяСтрока, 2).Value = 0;
		Лист.Cells(ТекущаяСтрока, 3).Value = 0;
		Лист.Cells(ТекущаяСтрока, 4).Value = 0;
		Лист.Cells(ТекущаяСтрока, 5).Value = 0;
	Иначе
		Лист.Cells(ТекущаяСтрока, 2).FormulaLocal = СтрШаблон("=СУММ(B3:B%1)", ТекущаяСтрока - 1);
		Лист.Cells(ТекущаяСтрока, 3).FormulaLocal = СтрШаблон("=СУММ(C3:C%1)", ТекущаяСтрока - 1);
		Лист.Cells(ТекущаяСтрока, 4).FormulaLocal = СтрШаблон("=СУММ(D3:D%1)", ТекущаяСтрока - 1);
		Лист.Cells(ТекущаяСтрока, 5).FormulaLocal = СтрШаблон("=СУММ(E3:E%1)", ТекущаяСтрока - 1);
	КонецЕсли;
	
	Excel.WorkSheets(1).Cells(17, 3).FormulaLocal = СтрШаблон("='Балансовая стоимость юр. лиц'!B%1", ТекущаяСтрока);
	
	ТекущаяСтрока = ТекущаяСтрока + 3;
	ПерваяСтрокаИтогов = ТекущаяСтрока;
	Для Каждого СтрокаДанных Из Отчет.ИтогиПоВидамДоговоров Цикл
		Если ВидыДоговоровРаздела.Найти(СтрокаДанных.ВидДоговораДоверительногоУправления) <> Неопределено Тогда
			Область = Лист.Cells(ТекущаяСтрока, 5);
			Область.EntireRow.Select();
			Область.EntireRow.Copy();
			Область.EntireRow.Insert();
				
			Лист.Cells(ТекущаяСтрока, 1).Value = Строка(СтрокаДанных.ВидДоговораДоверительногоУправления);
		 	Лист.Cells(ТекущаяСтрока, 2).Value = СтрокаДанных.Баланс;
		 	Лист.Cells(ТекущаяСтрока, 3).Value = СтрокаДанных.СЧА;
		 	Лист.Cells(ТекущаяСтрока, 4).Value = СтрокаДанных.КредиторскаяЗадолженность;
			
			Лист.Cells(ТекущаяСтрока, 5).FormulaLocal = СтрШаблон("=B%1-(C%1+D%1)", ТекущаяСтрока);
		 
			ТекущаяСтрока = ТекущаяСтрока + 1;
	    КонецЕсли;
	КонецЦикла;
	
	Лист.Range(СтрШаблон("A%1:E%1", ТекущаяСтрока)).Font.Bold = Истина; //Жирный шрифт
	Лист.Cells(ТекущаяСтрока, 1).Value = "Итого:";
	
	Если ТекущаяСтрока = 6 Тогда
		Лист.Cells(ТекущаяСтрока, 2).Value = 0;
		Лист.Cells(ТекущаяСтрока, 3).Value = 0;
		Лист.Cells(ТекущаяСтрока, 4).Value = 0;
		Лист.Cells(ТекущаяСтрока, 5).Value = 0;
	Иначе
		Лист.Cells(ТекущаяСтрока, 2).FormulaLocal = СтрШаблон("=СУММ(B%1:B%2)", ПерваяСтрокаИтогов, ТекущаяСтрока - 1);
		Лист.Cells(ТекущаяСтрока, 3).FormulaLocal = СтрШаблон("=СУММ(C%1:C%2)", ПерваяСтрокаИтогов, ТекущаяСтрока - 1);
		Лист.Cells(ТекущаяСтрока, 4).FormulaLocal = СтрШаблон("=СУММ(D%1:D%2)", ПерваяСтрокаИтогов, ТекущаяСтрока - 1);
		Лист.Cells(ТекущаяСтрока, 5).FormulaLocal = СтрШаблон("=СУММ(E%1:E%2)", ПерваяСтрокаИтогов, ТекущаяСтрока - 1);
	КонецЕсли;
	
	Лист.Cells(1, 1).Select();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФизЛица(Excel)
	
	Лист = Excel.WorkSheets(4);
	Лист.Activate();
	
	ТекущаяСтрока = 2;
	
	Разделы = Новый Массив;
	
#Область ФизЛица
	ВидыДоговоровРаздела = Новый Массив;
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.УправлениеАктивамиФизическогоЛица);
	ВидыДоговоровРаздела.Добавить(ЭтаФорма.ВидыДоговоров.ИндивидуальныйИнвестиционныйСчет);
	
	Разделы.Добавить(Новый Структура("ВидыДоговоровРаздела,СтрокаЗаголовка", ВидыДоговоровРаздела));
#КонецОбласти

	Для Каждого Раздел Из Разделы Цикл
		Раздел.Вставить("СтрокаЗаголовка",  ТекущаяСтрока - 1);
		
		Для Каждого СтрокаДанных Из Отчет.ДанныеОтчета Цикл
			Если Раздел.ВидыДоговоровРаздела.Найти(СтрокаДанных.ВидДоговораДоверительногоУправления) <> Неопределено Тогда
				
				Лист.Cells(ТекущаяСтрока, 1).Value = Строка(СтрокаДанных.СчетДоверительногоУправления);
			 	Лист.Cells(ТекущаяСтрока, 2).Value = СтрокаДанных.СЧА;
				
				СтрокаДанных.УчтенВОтчете = Истина;
			 
				ТекущаяСтрока = ТекущаяСтрока + 1;

			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Лист.Range(СтрШаблон("A1:B%1",	ТекущаяСтрока)).Borders.LineStyle = Истина; //рамка
	Лист.Range(СтрШаблон("A%1:B%1", ТекущаяСтрока)).Font.Bold = Истина; //Жирный шрифт
	Лист.Cells(ТекущаяСтрока, 1).Value = "Итого:";
	
	Если ТекущаяСтрока = 2 Тогда
		Лист.Cells(ТекущаяСтрока, 2).Value = 0;
	Иначе
		Лист.Cells(ТекущаяСтрока, 2).FormulaLocal = СтрШаблон("=СУММ(B2:B%1)", ТекущаяСтрока - 1);
	КонецЕсли;
	
	Лист.Cells(1, 1).Select();
	
	Excel.WorkSheets(1).Cells(16, 3).FormulaLocal = СтрШаблон("='Стоимость ФЛ'!B%1", ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти
